{
  "cat2id": {
    "armchair": 1,
    "bar": 2,
    "bed": 3,
    "bookcase / jewelry armoire": 4,
    "bookshelf": 5,
    "cabinet": 6,
    "ceiling_lamp": 7,
    "chair": 8,
    "coffee_table": 9,
    "desk": 10,
    "dining_chair": 11,
    "dining_table": 12,
    "floor_lamp": 13,
    "lamp": 14,
    "nightstand": 15,
    "others": 16,
    "side_table": 17,
    "simulated cloth": 18,
    "sofa": 19,
    "standard": 20,
    "stool": 21,
    "table": 22,
    "tv_stand": 23,
    "wardrobe": 24,
    "wine cooler": 25
  },
  "id2cat": {
    "1": "armchair",
    "2": "bar",
    "3": "bed",
    "4": "bookcase / jewelry armoire",
    "5": "bookshelf",
    "6": "cabinet",
    "7": "ceiling_lamp",
    "8": "chair",
    "9": "coffee_table",
    "10": "desk",
    "11": "dining_chair",
    "12": "dining_table",
    "13": "floor_lamp",
    "14": "lamp",
    "15": "nightstand",
    "16": "others",
    "17": "side_table",
    "18": "simulated cloth",
    "19": "sofa",
    "20": "standard",
    "21": "stool",
    "22": "table",
    "23": "tv_stand",
    "24": "wardrobe",
    "25": "wine cooler"
  },
  "room2id": {
    "aisle": 1,
    "auditorium": 2,
    "balcony": 3,
    "bathroom": 4,
    "bedroom": 5,
    "cloakroom": 6,
    "corridor": 7,
    "courtyard": 8,
    "dining_room": 9,
    "diningroom": 10,
    "elderlyroom": 11,
    "equipmentroom": 12,
    "garage": 13,
    "hallway": 14,
    "kidsroom": 15,
    "kitchen": 16,
    "laundryroom": 17,
    "library": 18,
    "living_room": 19,
    "livingdiningroom": 20,
    "lounge": 21,
    "masterbedroom": 22,
    "nannyroom": 23,
    "office": 24,
    "otherroom": 25,
    "secondbedroom": 26,
    "stairwell": 27,
    "storageroom": 28,
    "terrace": 29
  },
  "id2room": {
    "1": "aisle",
    "2": "auditorium",
    "3": "balcony",
    "4": "bathroom",
    "5": "bedroom",
    "6": "cloakroom",
    "7": "corridor",
    "8": "courtyard",
    "9": "dining_room",
    "10": "diningroom",
    "11": "elderlyroom",
    "12": "equipmentroom",
    "13": "garage",
    "14": "hallway",
    "15": "kidsroom",
    "16": "kitchen",
    "17": "laundryroom",
    "18": "library",
    "19": "living_room",
    "20": "livingdiningroom",
    "21": "lounge",
    "22": "masterbedroom",
    "23": "nannyroom",
    "24": "office",
    "25": "otherroom",
    "26": "secondbedroom",
    "27": "stairwell",
    "28": "storageroom",
    "29": "terrace"
  },
  "anchor2id": {
    "floating": 0,
    "against_wall": 1
  },
  "id2anchor": {
    "0": "floating",
    "1": "against_wall"
  },
  "max_items": 12,
  "room_num_mean": [
    5.442861080169678,
    5.577058792114258,
    2.5365891456604004,
    33.806941986083984,
    1.0625478029251099
  ],
  "room_num_std": [
    2.5939478874206543,
    2.495069980621338,
    0.22877249121665955,
    33.25396728515625,
    0.4835626184940338
  ],
  "item_num_mean": [
    0.19578491151332855,
    0.16930171847343445,
    0.3140651285648346,
    0.03925691172480583
  ],
  "item_num_std": [
    0.13682018220424652,
    0.10970786958932877,
    0.173038050532341,
    0.05190027505159378
  ],
  "model_config": {
    "item_num_dim": 4,
    "room_num_dim": 5,
    "cat_emb_dim": 48,
    "room_emb_dim": 16,
    "d_model": 128,
    "nhead": 8,
    "num_layers": 4,
    "dropout": 0.1
  },
  "data_checks": {
    "layout_df_rows": 289901,
    "scene_rows": 29288,
    "finite_training_history": 25
  }
}