{
  "categories": [
    "<pad>",
    "armchair",
    "bathtub",
    "bed",
    "book",
    "cabinet",
    "chair",
    "coffee_table",
    "counter",
    "curtain",
    "decor",
    "desk",
    "dining_table",
    "door",
    "lamp",
    "mirror",
    "nightstand",
    "plant",
    "rug",
    "shelf",
    "sink",
    "sofa",
    "toilet",
    "tv",
    "tv_stand",
    "unknown",
    "vase",
    "wall_art",
    "wardrobe",
    "window"
  ],
  "room_types": [
    "<pad>",
    "bathroom",
    "bedroom",
    "dining_room",
    "kitchen",
    "living_room",
    "office",
    "unknown"
  ],
  "styles": [
    "<pad>",
    "industrial",
    "luxury",
    "minimal",
    "modern",
    "scandinavian",
    "traditional",
    "unknown"
  ],
  "layers": [
    "<pad>",
    "ceiling",
    "floor",
    "floor_under",
    "top_surface",
    "unknown",
    "wall"
  ],
  "anchors": [
    "<pad>",
    "against_wall",
    "center",
    "corner",
    "free",
    "on_support",
    "under_group",
    "unknown",
    "wall_mounted"
  ],
  "zones": [
    "<pad>",
    "back_wall",
    "center",
    "corner",
    "free",
    "front_wall",
    "left_wall",
    "right_wall",
    "support_top",
    "under_group",
    "unknown"
  ],
  "groups": [
    "<pad>",
    "bath",
    "decor",
    "dining",
    "seating",
    "sleeping",
    "storage",
    "unknown",
    "work"
  ],
  "nearest_walls": [
    "<pad>",
    "back",
    "front",
    "left",
    "none",
    "right",
    "unknown"
  ],
  "support_states": [
    "<pad>",
    "is_supporter",
    "needs_support",
    "none",
    "supported",
    "unknown",
    "wall_mounted"
  ],
  "stoi": {
    "categories": {
      "<pad>": 0,
      "armchair": 1,
      "bathtub": 2,
      "bed": 3,
      "book": 4,
      "cabinet": 5,
      "chair": 6,
      "coffee_table": 7,
      "counter": 8,
      "curtain": 9,
      "decor": 10,
      "desk": 11,
      "dining_table": 12,
      "door": 13,
      "lamp": 14,
      "mirror": 15,
      "nightstand": 16,
      "plant": 17,
      "rug": 18,
      "shelf": 19,
      "sink": 20,
      "sofa": 21,
      "toilet": 22,
      "tv": 23,
      "tv_stand": 24,
      "unknown": 25,
      "vase": 26,
      "wall_art": 27,
      "wardrobe": 28,
      "window": 29
    },
    "room_types": {
      "<pad>": 0,
      "bathroom": 1,
      "bedroom": 2,
      "dining_room": 3,
      "kitchen": 4,
      "living_room": 5,
      "office": 6,
      "unknown": 7
    },
    "styles": {
      "<pad>": 0,
      "industrial": 1,
      "luxury": 2,
      "minimal": 3,
      "modern": 4,
      "scandinavian": 5,
      "traditional": 6,
      "unknown": 7
    },
    "layers": {
      "<pad>": 0,
      "ceiling": 1,
      "floor": 2,
      "floor_under": 3,
      "top_surface": 4,
      "unknown": 5,
      "wall": 6
    },
    "anchors": {
      "<pad>": 0,
      "against_wall": 1,
      "center": 2,
      "corner": 3,
      "free": 4,
      "on_support": 5,
      "under_group": 6,
      "unknown": 7,
      "wall_mounted": 8
    },
    "zones": {
      "<pad>": 0,
      "back_wall": 1,
      "center": 2,
      "corner": 3,
      "free": 4,
      "front_wall": 5,
      "left_wall": 6,
      "right_wall": 7,
      "support_top": 8,
      "under_group": 9,
      "unknown": 10
    },
    "groups": {
      "<pad>": 0,
      "bath": 1,
      "decor": 2,
      "dining": 3,
      "seating": 4,
      "sleeping": 5,
      "storage": 6,
      "unknown": 7,
      "work": 8
    },
    "nearest_walls": {
      "<pad>": 0,
      "back": 1,
      "front": 2,
      "left": 3,
      "none": 4,
      "right": 5,
      "unknown": 6
    },
    "support_states": {
      "<pad>": 0,
      "is_supporter": 1,
      "needs_support": 2,
      "none": 3,
      "supported": 4,
      "unknown": 5,
      "wall_mounted": 6
    }
  },
  "pad_idx": {
    "categories": 0,
    "room_types": 0,
    "styles": 0,
    "layers": 0,
    "anchors": 0,
    "zones": 0,
    "groups": 0,
    "nearest_walls": 0,
    "support_states": 0
  },
  "numeric_features": [
    "room_width_m",
    "room_length_m",
    "room_height_m",
    "room_area_m2",
    "w_norm",
    "d_norm",
    "h_norm",
    "area_ratio",
    "nearest_wall_distance_norm",
    "support_surface_area_norm",
    "needs_support",
    "is_supporter",
    "is_wall_object",
    "is_floor_under",
    "on",
    "supported_by",
    "supports",
    "under",
    "near",
    "against_wall",
    "wall_attached",
    "facing",
    "same_group",
    "clearance_conflict",
    "mass_kg_est",
    "max_load_kg_est",
    "clearance_required_m"
  ]
}